app/views/home/index.html.erb

                            <div class="entry__content">
                                <span class="entry__category"><a href="#0"><%=@posts[0].genres.first.list%></a></span>
---
SELECT "genres".* FROM "genres" INNER JOIN "genres_posts" ON "genres"."id" = "genres_posts"."genre_id" WHERE "genres_posts"."post_id" = $1 ORDER BY "genres"."id" ASC LIMIT $2  [["post_id", 1], ["LIMIT", 1]]

                            <div class="entry__content">
                                <span class="entry__category"><a href="#0"><%=@posts[1].genres.first.list%></a></span>
---
SELECT "genres".* FROM "genres" INNER JOIN "genres_posts" ON "genres"."id" = "genres_posts"."genre_id" WHERE "genres_posts"."post_id" = $1 ORDER BY "genres"."id" ASC LIMIT $2  [["post_id", 2], ["LIMIT", 1]]

                            <div class="entry__content">
                                <span class="entry__category"><a href="#0"><%=@posts[2].genres.first.list%></a></span>
---
SELECT "genres".* FROM "genres" INNER JOIN "genres_posts" ON "genres"."id" = "genres_posts"."genre_id" WHERE "genres_posts"."post_id" = $1 ORDER BY "genres"."id" ASC LIMIT $2  [["post_id", 3], ["LIMIT", 1]]

                            <div class="item-entry__cat">
                                <a href="category.html"><%=post.genres.first.list%></a>
---
SELECT "genres".* FROM "genres" INNER JOIN "genres_posts" ON "genres"."id" = "genres_posts"."genre_id" WHERE "genres_posts"."post_id" = $1 ORDER BY "genres"."id" ASC LIMIT $2  [["post_id", 4], ["LIMIT", 1]]