app/views/posts/new.html.erb

						<label>Ville de l'evenement</label>
						<%= select("post", "city_id", City.all.collect {|p| [p.ville, p.id] }) %>
---
SELECT "cities".* FROM "cities"