app/controllers/home_controller.rb

SELECT "posts".* FROM "posts"
SELECT "posts".* FROM "posts" LIMIT $1  [["LIMIT", 3]]
---
	def index
		@post = Post.limit(4)
		@posts = Array.new
		@post.each do |val|